Repository: saifbataineh/pharmagradproj
Catalog: lib/l10n/intl_*.arb
Languages: ar

# lagn
source: عربي
ar: English

source: Log In
ar: تسجيل دخول

source: Sign Up
ar: انشاء حساب

# yournamesu
source: Your name
ar: اسمك

source: Sign Up Page
ar: صفحة انشاء الحساب

source: name
ar: الاسم

# shortName
source: your name must be 4 charachters at least
ar: الاسم يجب ان يكون 4 احرف على الاقل

source: email
ar: البريد الالكتروني

# emailError
source: Email must contain @
ar: @ البريد الالكتروني يجب ان يحتوي على الرمز

# plspass
source: enter password that at least 5 charachters
ar: ادخل كلمة سر مكونة من 5 احرف على الاقل

# pass
source: password
ar: الرقم السري

# confirmPass
source: confirmed password
ar: تأكيد الرقم السري

# doublecheckpass
source: please confirm your password
ar: الرجاء ادخال كلمة السر مرة اخرى

# doesmatch
source: passwords doesn't match
ar: كلمتا السر لا تتطابقان

# weakPass
source: weak Password
ar: كلمة السر ضعيفة

# alreadyInUse
source: The account already exists for that email.
ar: يوجد حساب اخر بنفس البريد الالكتروني

# error
source: something went wrong, please try again
ar: حدث خطأ ما الرجاء المحاولة من جديد لاحقا

# suc
source: success
ar: تمت العملية بنجاح

# error2
source: please check your password or email
ar: الرجاء التأكد من كلمة السر او البريد الالكتروني

source: Sign In Page
ar: صفحة تسجيل الدخول

# ays
source: are you sure you want to exit
ar: هل أنت متأكد انك تريد الخروج ؟

# wtl
source: you want to leave
ar: أتريد مغادرة

source: Pharma Tails
ar: فارما تيلز

# nvm
source: Never mind
ar: لا تهتم

source: leave
ar: غادر

# searchDrug
source: Search For Your Drug
ar: البحث عن الدواء

# nearPharma
source: Nearest Pharmacies
ar: أقرب الصيدليات

# alarm
source: Alarm For Drug Doses
ar: منبه الجرعات الدوائية

source: Records
ar: سجلاتك

# textSearch
source: Search For Drug Via Voice or Text
ar: البحث عن الدواء باستخدام الاسم او الصوت

# cameraSearch
source: Search By Name Using Camera
ar: البحث باستخدام الكاميرا

# barcodeSearch
source: Search By Barcode Using Camera
ar: البحث باستخدام الباركود

# searchInput
source: Enter Drug Name:
ar: ادخل اسم الدواء:

# searchVoice
source: hold the button and start speaking
ar: استمر بالضغط اثناء الحديث

# plspress
source: * if you don't see the suggetions please tap on the text form
ar: * اذا كنت لا ترى الاقتراحات رجاءا اضغط على صندوق البحث

# titleCamera
source: take photo of the drug package
ar: صور علبة الدواء

# checkPhoto
source: discover the drug
ar: اكتشف الدواء

# cameraPermission
source: Camera permission is denied
ar: لم يسمح الوصول الى الكاميرا

# camraError
source: an error occured when scanning the text
ar: حدث خطأ أثناء فحص الصورة

source: Open Scanner
ar: فتح الماسح

# NobarCode
source: No Bar Code Were Found, Please Try Again.
ar: لا يوجد دواء بهاذا الرقم الرجاء المحاولة من جديد

source: Result
ar: نتيجة البحث

source: uses:
ar: :الاستخدامات

source: SideEffects
ar: الأعراض الجانبية

# jor_price
source: Jordanian public price
ar: سعر الجمهور الأردني

# hos_price
source: Hospital price
ar: سعر المستشفى

# ph_price
source: Pharmacist price
ar: سعر الصيدلي

source: Packing
ar: التعبئة

source: Generic Name
ar: الاسم العلمي

# barcoden
source: Bar Code
ar: البار كود

# alarmPillsLeft
source: Pills Left!
ar: الحبات المتبقية!

# noPrice
source: have no available price!
ar: لا وجود لسعر

# alarmMissingValue
source: please enter the drug name
ar: الرجاء ادخال اسم الدواء

# alarmMissingValue2
source: please enter the pills number
ar: الرجاء ادخال عدد حبات الدواء

# alarmMissingValue3
source: please enter the daily dose
ar: الرجاء ادخال الجرعة اليومية

# alarmName
source: your Drug
ar: دوائك

# alarmName2
source: Drug Name
ar: اسم الدواء

# alarmEmpty
source: No alarm(s) is set yet
ar: لا يوجد منبهات حاليا

# alarmAddbutton
source: Add your drug
ar: اضافة منبه

# alarmPacking
source: Packing
ar: التعبئة

# alarmPacking2
source: Number Of pills
ar: عدد الحبات

# alarmDose
source: dayly Dose
ar: الجرعة اليومية

# alarmDose1
source: Dose
ar: الجرعة

# alarmText
source: Way of taking the medication
ar: كيفية اخذ الدواء

# alarmPills
source: Pills
ar: حبوب

# alarmSyrup
source: Syrup
ar: شراب

# alarmDrops
source: Drops
ar: قطرات

# alarmSave
source: set Alarm
ar: ضبط المنبه

# alarmCancel
source: Cancel
ar: الغاء

# errorText
source: Something went wrong
ar: حدث خطأ ما

source: Loading...
ar: جاري التحميل

# pharmaOpen
source: Open Now
ar: متاح حاليا

# pharmaClosed
source: Closed
ar: مغلق

# loading
source: Loading Locations...
ar: جاري تحميل الأماكن

# nopharma
source: No pharmacies located with
ar: لا يوجد صيدليات تحتوي

source: Return
ar: رجوع

# yourLcoation
source: Your location
ar: موقعك

# checkInt
source: Check your internet connection for better usage to directions and location information.
ar: تأكد من اتصالك بالشبكة و بخدمة تحديد المواقع لتجربة أفضل

# connect
source: Connect to Maps...
ar: الاتصال بالخرائط...

# locationServ
source: Location Service Disabled.
ar: خدمة تحديد الموقع معطلة

# locationden
source: Location Access Denied.
ar: الوصول الى خدمة المواقع معطل.

# nointcon
source: No Internet Connection, Check your internet connection.
ar: لا يوجد لديك اتصال بالانترنت الرجاء ، الرجاء التأكد من الاتصال

# alter
source: alternatives
ar: البدائل
